experiments/position-visibility/results/bench-c1long_arm_a_c1_s2.txt
pgbench (17.10 (Debian 17.10-1.pgdg13+1))
transaction type: /harness/bench/append.sql
scaling factor: 1
query mode: prepared
number of clients: 1
number of threads: 1
maximum number of tries: 1
duration: 90 s
number of transactions actually processed: 47328
number of failed transactions: 0 (0.000%)
latency average = 1.902 ms
initial connection time = 1.615 ms
tps = 525.866848 (without initial connection time)