experiments/position-visibility/results/bench_arm_a_c32_s20.txt
pgbench (17.10 (Debian 17.10-1.pgdg13+1))
transaction type: /harness/bench/append.sql
scaling factor: 1
query mode: prepared
number of clients: 32
number of threads: 4
maximum number of tries: 1
duration: 30 s
number of transactions actually processed: 13659
number of failed transactions: 0 (0.000%)
latency average = 70.302 ms
initial connection time = 28.670 ms
tps = 455.179742 (without initial connection time)