experiments/position-visibility/results/bench_arm_c_c8_s17.txt
pgbench (17.10 (Debian 17.10-1.pgdg13+1))
transaction type: /harness/bench/append.sql
scaling factor: 1
query mode: prepared
number of clients: 8
number of threads: 4
maximum number of tries: 1
duration: 30 s
number of transactions actually processed: 44931
number of failed transactions: 0 (0.000%)
latency average = 5.341 ms
initial connection time = 10.705 ms
tps = 1497.955951 (without initial connection time)