experiments/position-visibility/results/bench_baseline_c1_s3.txt
pgbench (17.10 (Debian 17.10-1.pgdg13+1))
transaction type: /harness/bench/append.sql
scaling factor: 1
query mode: prepared
number of clients: 1
number of threads: 1
maximum number of tries: 1
duration: 30 s
number of transactions actually processed: 4918
number of failed transactions: 0 (0.000%)
latency average = 6.101 ms
initial connection time = 2.500 ms
tps = 163.905753 (without initial connection time)