experiments/position-visibility/results/bench_baseline_c8_s16.txt
pgbench (17.10 (Debian 17.10-1.pgdg13+1))
transaction type: /harness/bench/append.sql
scaling factor: 1
query mode: prepared
number of clients: 8
number of threads: 4
maximum number of tries: 1
duration: 30 s
number of transactions actually processed: 45329
number of failed transactions: 0 (0.000%)
latency average = 5.294 ms
initial connection time = 6.167 ms
tps = 1511.041665 (without initial connection time)