experiments/position-visibility/results/staleness_load_c32.txt
pgbench (17.10 (Debian 17.10-1.pgdg13+1))
transaction type: /harness/bench/append.sql
scaling factor: 1
query mode: prepared
number of clients: 32
number of threads: 4
maximum number of tries: 1
duration: 40 s
number of transactions actually processed: 276372
number of failed transactions: 0 (0.000%)
latency average = 4.631 ms
initial connection time = 13.510 ms
tps = 6909.237990 (without initial connection time)